{
  "blogs": [
    {
      "title": "Travel",
      "body": "At the end of 2020, I wrote about trying to recover what I called “the lost year” — the year in which I got COVID, saw all my businesses collapse, took out tons of loans to avoid bankruptcy, and, like everyone, had to put all my life plans (settling down, buying a house, joining some social clubs, dating) on a seemingly endless hold.\n\nAs the year wound to a close, I needed a mental break, so I went to Mexico with friends, with a plan to rent a house and stay in the Tulum/Playa area. Over the next seven weeks, I fell in love with the country and, specifically, Oaxaca. (Tulum sucked so we left.)\n\nThis year, the vaccine became available, many countries reopened their borders, and I headed back out on the road. I always describe travel like a battery, and, after over a year of being home, mine was overcharged. I was like a kid who had just been given back his toy after a long time-out. I wanted to play with it extra long, and nothing was going to get in my way.\n\n",
      "author": "Ahmed Salem",
      "id": 1
    },
    {
      "title": "Friendship",
      "body": "Many of us have friends in our lives over the years. Some friends we make as children and then lose contact as we grow older. Other friends we make as adults and stay in touch with as long as we are in close proximity to and it is convenient to keep in touch but then over time one moves away or busy schedules slowly pull us apart and we start to lose touch.  Those friendships fall into the “good friends” or “close friends” as the opening quote cites. But then there is that last group of friends – those we call true friends – they are those we have a mutual caring about, and we understand each other’s hearts, and where bonds are formed between us that span any distance in proximity and where the bonds run so deep that no amount of time apart or lack of words will change the way we feel about that friend. These are our true friends, and when one comes into your life cherish it! As a child our family moved often and so I was constantly making new friends each place we moved. Often the contact was lost with friends in past locations, although my memories of them were treasured. As an adult it is often harder to find the time to form those deep friendships outside your immediate family members because we are all trying to juggle a million balls in the air with work and church and service and community all while trying to give our greatest attention to our own children and spouses  where it rightfully belongs. And as a single mother for many years of my life it was even more difficult to make time for friends because playing the role of two parents by yourself while also being the sole support of your family was overwhelming to say the least.",
      "author": "Salem",
      "id": 2
    },
    {
      "title": "Fitness",
      "body": "No pain, no gain.\n\nIf it’s easy, you’re doing it wrong.\n\nIf you’re not sweating, you’re not really exercising.\n\nYou have probably heard statements like these before, but they leave the wrong impression about exercise. Fortunately, more people are beginning to recognize that the key to making progress is less about pushing through pain and more about participating in daily movement and exercising to feel good and be able to do the things you love.\n\nOptimal health and fitness, the kind all of us need, come from constantly moving your body in ways that keep you available, keep you in the game. Because no matter how hard you can push, if you’re injured or sick, you’re on the bench.\n\nIf this has you sweating, because you love sweating, don’t fret. The more you recover, the more you can push when you do tougher workouts. Active recovery, which is low impact and low- to moderate-intensity movement, increases blood flow to muscle tissue. This is a necessary part of the repair process, but it won’t happen if you keep pounding the pavement or hitting the gym hard during every exercise session. Light movement designed to keep you feeling good speeds up your recovery so the next time you do push, you can push harder.\n\nFeeling sore? Active recovery also decreases pain, according to a 2018 study.\n\nProfessional athletes like NBA great LeBron James and 44-year-old multiple Super Bowl champion Tom Brady know this as well. It’s not the push that gets them ahead. It’s how they recover. It’s the work they do in between games: the ice baths, the massages, the active and focused “easy” movements.\n\nYou only get stronger when you recover. Your muscles need time to repair and rebuild after a bout of physical exertion. The greater the intensity, training volume, or duration of the activity performed the more consideration is needed for the frequency, intensity, time, and type of recovery performed. But proper recovery doesn’t just mean massages and foam rolling. It really means getting eight hours of sleep per night, maintaining an adequate state of hydration, and staying on top of your nutrition. It’s also about managing your stress and taking time to activate your parasympathetic nervous system, every day.",
      "author": "Ahmed",
      "id": 3
    }
  ]
}